class Solution:
    """
    思路：使用两个栈，一个栈存放要重复的字符，一个栈存放重复的次数，一边遍历一边重复再压回栈，现在问题就变成了如何正确将数据放入栈中
    字符和数字都可能是n位数，所以需要一个累加的过程
    发现一个规律，当遇到 “[”时，数字和字符的累加结束，将当前的累加结果都入栈，然后开始新一轮的累加
    此处有两个细节，
        第一：就是字符串需要累加的话需要一个原始的空串
        第二：每次重复完毕的字符串会加到字符串栈的栈顶元素后面，这就必须为栈初始化的时候就压入一个空串，防止最后一次重复的字符串加入栈顶元素尾部的时候报错
    """

    def decodeString(self, s: str) -> str:
        abc = [""]  # 字符串栈，初始化时需要放入一个空串去和最后一次的重复字符串相加
        nums = []  # 重复次数栈
        num = 0  # 累加器
        for c in s:
            if c == "[":  # 将累加结果入栈，初始化累加器
                nums.append(num)
                num = 0
                abc.append("")
            elif c == "]":  # 将重复结果添加到栈顶元素的末尾
                t = abc.pop()
                abc[-1] += nums.pop() * t
            elif c.islower():  # 字符累加到栈顶元素的末尾
                abc[-1] += c
            else:
                num *= 10  # 重复次数累加
                num += int(c)

        return abc[0]  # 最终的栈顶字符串就是最终结果


if __name__ == "__main__":
    Solution().decodeString("3[a2[c]]")
